[{"items":[{"name":"getting_started","title":"Getting Started with Touch 2","description":"A short introduction to what Sencha Touch is and how to use it for your first app"},{"name":"whats_new","title":"What's new in Touch 2.0","description":"Everything that changed since 1.x, including performance upgrades, API improvements, MVC, DataView and class system improvements"},{"name":"upgrade_1_to_2","title":"Migrating from 1.x","description":"Guides you through the process of migrating your application from Sencha Touch 1"}],"title":"Overview"},{"items":[{"name":"apps_intro","title":"Intro to Applications","description":"Introduces the core concepts about writing applications in Sencha Touch 2 - introduces MVC, routing, device profiles and more"},{"name":"profiles","title":"Device Profiles","description":"Device Profiles enable you to easily write universal apps that can present customized UIs on phones and tablets"},{"name":"controllers","title":"Controllers","description":"Introduces all of the core concepts around Controllers, including refs, control and routes"}],"title":"Writing Applications"},{"items":[{"name":"components","title":"Components","description":"All of the Components in Sencha Touch follow the same pattern and API conventions - this guide teaches you all about it"},{"name":"layouts","title":"Layouts","description":"Sencha Touch employs a powerful layout engine that makes it easy to size and position your components on screen"},{"name":"class_system","title":"The Class System","description":"Tells you all you need to know about the Sencha Touch class. We suggest you read this before you start your first app"}],"title":"Concepts"},{"items":[{"name":"forms","title":"Using Forms","description":"Introduces Form Panels and the fields that they can contain. Shows how to load data, submit to the server and more"},{"name":"dataview","title":"Using DataViews","description":"DataViews are a great way to generate lots of components based on a Store. Great for lists, mailboxes, settings screens and more"},{"name":"carousel","title":"Using Carousels","description":"Carousels allow you to swipe between screens and work well on tablets and phone screens"},{"name":"list","title":"Using Lists","description":"Lists are great at showing lots of information, and pack loads of functionality in out of the box. Find out how to use them here"},{"name":"tabs","title":"Using TabPanels","description":"TabPanels are useful to swapping between different pages of an app, with either top or bottom tabs"}],"title":"Components"},{"items":[{"name":"data","title":"Data Package Overview","description":"Introduces the Data Package as a whole, showing you how everything is connected. See the other data guides for more detail"},{"name":"models","title":"Using Models","description":"Introduces the concept of a Model, where they are used and how to configure fields, validations, associations and more"},{"name":"stores","title":"Using Stores","description":"Introduces the concept of Stores, which load data and underpin data-bound Components such as Lists and DataViews"},{"name":"proxies","title":"Using Proxies","description":"Introduces the concept of a Proxy, which is responsible for loading and saving data in your Models and Stores"}],"title":"Data"},{"items":[{"name":"native_packaging","title":"Native iOS Packaging","description":"Native Packaging for iOS on Mac"},{"name":"native_android","title":"Native Android Packaging","description":"Native Packaging for Android on Mac"}],"title":"Packaging"}]